rhoSimpleFoam/squareBend/0/C
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volVectorField;
    location    "0";
    object      C;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<vector> 
112000
(
(-0.04875 0.02625 0.02375)
(-0.04625 0.02625 0.02375)
(-0.04375 0.02625 0.02375)
(-0.04125 0.02625 0.02375)
(-0.03875 0.02625 0.02375)
(-0.03625 0.02625 0.02375)
(-0.03375 0.02625 0.02375)
(-0.03125 0.02625 0.02375)
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(-0.05 0.02625 0.02375)
(-0.05 0.02625 0.02125)
(-0.05 0.02625 0.01875)
(-0.05 0.02625 0.01625)
(-0.05 0.02625 0.01375)
(-0.05 0.02625 0.01125)
(-0.05 0.02625 0.00875)
(-0.05 0.02625 0.00625)
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<vector> 
400
(
(-0.5 -0.07375 0.02375)
(-0.5 -0.07375 0.02125)
(-0.5 -0.07375 0.01875)
(-0.5 -0.07375 0.01625)
(-0.5 -0.07375 0.01375)
(-0.5 -0.07375 0.01125)
(-0.5 -0.07375 0.00875)
(-0.5 -0.07375 0.00625)
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<vector> 
22400
(
(-0.04875 0.02625 0.025)
(-0.04875 0.02875 0.025)
(-0.04875 0.03125 0.025)
(-0.04875 0.03375 0.025)
(-0.04875 0.03625 0.025)
(-0.04875 0.03875 0.025)
(-0.04875 0.04125 0.025)
(-0.04875 0.04375 0.025)
...
)
;
    }
}


// ************************************************************************* //
