rhoSimpleFoam/squareBend/0/Cx
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cx;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112000
(
-0.04875
-0.04625
-0.04375
-0.04125
-0.03875
-0.03625
-0.03375
-0.03125
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
-0.05
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
-0.5
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
22400
(
-0.04875
-0.04875
-0.04875
-0.04875
-0.04875
-0.04875
-0.04875
-0.04875
...
)
;
    }
}


// ************************************************************************* //
