rhoSimpleFoam/squareBend/0/Cz
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      Cz;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   nonuniform List<scalar> 
112000
(
0.02375
0.02375
0.02375
0.02375
0.02375
0.02375
0.02375
0.02375
...
)
;

boundaryField
{
    inlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.02375
0.02125
0.01875
0.01625
0.01375
0.01125
0.00875
0.00625
...
)
;
    }
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
400
(
0.02375
0.02125
0.01875
0.01625
0.01375
0.01125
0.00875
0.00625
...
)
;
    }
    walls
    {
        type            calculated;
        value           nonuniform List<scalar> 
22400
(
0.025
0.025
0.025
0.025
0.025
0.025
0.025
0.025
...
)
;
    }
}


// ************************************************************************* //
