rhoSimpleFoam/squareBend/system/isoSurface
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out iso-surface files with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/

isoField    cellCenterZ;
isoValue    0;

fields      (p U cellVolume rho cellCenter);

interpolate true; // If false, write cell data to the surface triangles.
                  // If true, write interpolated data at the surface points.

#includeEtc "caseDicts/postProcessing/surface/isoSurface.cfg"

// ************************************************************************* //
