rhoSimpleFoam/squareBend/system/isoSurface.cfg
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/

#includeEtc "caseDicts/postProcessing/surface/surface.cfg"

surfaces
(
    isoSurface
    {
        type        isoSurface;
        interpolate $interpolate;
        isoField    $isoField;
        isoValue    $isoValue;
    }
);

// ************************************************************************* //
