rhoSimpleFoam/squareBend/system/isoSurfaceDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes out iso-surface files with interpolated field data in VTK format.

\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      isoSurfaceDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

type        isoSurface;
isoField    cellCenterY;		//需要提取等值线的场，这里是压力场
isoValue    0;	//等值线的数值，这里三10Pa
filter      full;
interpolate yes;

// ************************************************************************* //
